---
type: BoundingBoxContainsPointFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# BoundingBoxContainsPointFilter

`Autodesk.Revit.DB.BoundingBoxContainsPointFilter` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | BoundingBoxContainsPointFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | Point | 2011 | `public XYZ Point { get ; set ; }` |
| Property | Tolerance | 2011 | `public double Tolerance { get ; set ; }` |